---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EdgeLinework
source: html/8d4ef877-0513-af1c-4fe3-7750c3e28726.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EdgeLinework Property

"Line Style"

## Syntax (C#)
```csharp
public static ForgeTypeId EdgeLinework { get; }
```